content/posts/Quantum_mechanics_and_quantum_field_theory_by_Jonathan_Dimock_in_2011.md
+++
title = "Quantum mechanics and quantum field theory by Jonathan Dimock in 2011"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:35:42-04:00
slug = "Quantum_mechanics_and_quantum_field_theory_by_Jonathan_Dimock_in_2011"
draft = false
+++

## I. Non-relativistic {#i-dot-non-relativistic}


### 1. Mathematical prelude {#1-dot-mathematical-prelude}

<!--list-separator-->

-  1.1 Bounded operators

<!--list-separator-->

-  1.2 Unbounded operators

<!--list-separator-->

-  1.3 Self-adjoint operators

<!--list-separator-->

-  1.4 Compact operators


### 2. Classical mechanics {#2-dot-classical-mechanics}

<!--list-separator-->

-  2.1 Hamiltonian mechanics

<!--list-separator-->

-  2.2 Examples

<!--list-separator-->

-  2.3 Canonical transformations

<!--list-separator-->

-  2.4 Symmetries


### 3. Quantum mechanics {#3-dot-quantum-mechanics}

<!--list-separator-->

-  3.1 Principles of quantum mechanics

<!--list-separator-->

-  3.2 Canonical quantization

<!--list-separator-->

-  3.3 Symmetries

<!--list-separator-->

-  3.4 Perspectives and problems


### 4. Single particle {#4-dot-single-particle}

<!--list-separator-->

-  4.1 Free particle

<!--list-separator-->

-  4.2 Particle in a potential

<!--list-separator-->

-  4.3 Spectrum

<!--list-separator-->

-  4.4 The harmonic oscillator

<!--list-separator-->

-  4.5 Scattering

<!--list-separator-->

-  4.6 Spin


### 5. Many particles {#5-dot-many-particles}

<!--list-separator-->

-  5.1 Two particles

<!--list-separator-->

-  5.2 Identical particles

<!--list-separator-->

-  5.3 n-particles

<!--list-separator-->

-  5.4 Fock space


### 6. Statistical mechanics {#6-dot-statistical-mechanics}

<!--list-separator-->

-  6.1 Mixed states

<!--list-separator-->

-  6.2 Equilibrium states

<!--list-separator-->

-  6.3 Free boson gas

<!--list-separator-->

-  6.4 Free fermion gas

<!--list-separator-->

-  6.5 Interacting bosons

<!--list-separator-->

-  6.6 Further developments


## II. Relativistic {#ii-dot-relativistic}


### 7. Relativity {#7-dot-relativity}

<!--list-separator-->

-  7.1 Principles of relativity

<!--list-separator-->

-  7.2 Minkowski space

<!--list-separator-->

-  7.3 Classical free fields

<!--list-separator-->

-  7.4 Interacting classical fields

<!--list-separator-->

-  7.5 Fundamental solutions


### 8. Scalar particles and fields {#8-dot-scalar-particles-and-fields}

<!--list-separator-->

-  8.1 Scalar particles

<!--list-separator-->

-  8.2 Scalar fields

<!--list-separator-->

-  8.3 Charged scalar field


### 9. Electrons and photons {#9-dot-electrons-and-photons}

<!--list-separator-->

-  9.1 [spinors]({{< relref "spinors" >}})

<!--list-separator-->

-  9.2 Electrons

<!--list-separator-->

-  9.3 Dirac fields

<!--list-separator-->

-  9.4 Photons

<!--list-separator-->

-  9.5 Electromagnetic field


### 10. Field theory on a manifold {#10-dot-field-theory-on-a-manifold}

<!--list-separator-->

-  10.1 Lorentzian manifolds

<!--list-separator-->

-  10.2 Classical fields on a manifold

<!--list-separator-->

-  10.3 Quantum fields on a manifold


## III. Probabilistic methods {#iii-dot-probabilistic-methods}


### 11. Path integrals {#11-dot-path-integrals}

<!--list-separator-->

-  11.1 Probability

<!--list-separator-->

-  11.2 Gaussian processes

<!--list-separator-->

-  11.3 Brownian motion

<!--list-separator-->

-  11.4 The Feynman-Kac formula

<!--list-separator-->

-  11.5 Oscillator process

<!--list-separator-->

-  11.6 Application: ground states


### 12. Fields as random variables {#12-dot-fields-as-random-variables}

<!--list-separator-->

-  12.1 More on Gaussian processes

<!--list-separator-->

-  12.2 The Schrodinger representation

<!--list-separator-->

-  12.3 Path integrals \* free fields

<!--list-separator-->

-  12.4 Vacuum correlation functions

<!--list-separator-->

-  12.5 Thermal correlation functions


### 13. A nonlinear field theory {#13-dot-a-nonlinear-field-theory}

<!--list-separator-->

-  13.1 The model

<!--list-separator-->

-  13.2 Regularization

<!--list-separator-->

-  13.3 Infinite volume

<!--list-separator-->

-  13.4 Path integrals \* interacting fields

<!--list-separator-->

-  13.5 A reformulation


## Appendices {#appendices}


### A. Normed spaces {#a-dot-normed-spaces}


### B. Tensor product {#b-dot-tensor-product}


### C. Distributions {#c-dot-distributions}
